src/InformationRegisters/рдв_ХешиОбъектов/рдв_ХешиОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рдв_ХешиОбъектов</name>
  <resources>
    <name>Хеш</name>
    <type>
      <types>DefinedType.рдв_ХешТип</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.рдв_ХешируемыйОбъект</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидХеша</name>
    <type>
      <types>CatalogRef.рдв_ВидыХешей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/рдв_ХешиОбъектовПовтИсп/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Новая таблица хешей
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//	  * ВидХеша - СправочникСсылка.рдв_ВидыХешей
//	  * Хеш - ОпределяемыйТип.рдв_ХешТип
//
Функция НоваяТаблицаХешей() Экспорт
	
	НоваяТаблицаХешей = рдв_ХешиОбъектовПереопределяемый.НоваяТаблицаХешей();
	
	Если Не НоваяТаблицаХешей = Неопределено Тогда
		Возврат НоваяТаблицаХешей;
	КонецЕсли;
	
	ТаблицаХешей = РегистрыСведений.рдв_ХешиОбъектов.СоздатьНаборЗаписей().ВыгрузитьКолонки("ВидХеша, Хеш");
	
	Возврат ТаблицаХешей;
	
КонецФункции

// Вид хеша, используемый по умолчанию для объектов
// 
// Возвращаемое значение:
//  СправочникСсылка.рдв_ВидыХешей
//
Функция ХешВидПоУмолчанию() Экспорт
	
	ВидХеша = рдв_ХешиОбъектовПереопределяемый.ХешВидПоУмолчанию();
	
	Возврат ВидХеша;
	
КонецФункции

#КонецОбласти
